tutorials/internal/planarPoiseullie/peridic/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

vertices
(   
    // back
    (-1 0  -1)
    ( 1 0  -1)
    ( 1 10 -1)
    (-1 10 -1)

    // front
    (-1 0   1)
    ( 1 0   1)
    ( 1 10  1)
    (-1 10  1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (1 64 1) simpleGrading (1 0.2 1)
);

boundary
(
    walls
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    
    left
    {
        type cyclic;
        neighbourPatch right;
        faces
        (
            (0 4 7 3)
        );
    }

    right
    {
        type cyclic;
        neighbourPatch left;
        faces
        (
            (2 6 5 1)
        );
    }

    centerline
    {
        type symmetryPlane;
        faces
        (
            (1 5 4 0)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);


// ************************************************************************* //
